# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Samuel\Documents\GitHub\Arm\Dynamixel_Servo_Driver\Dynamixel_Servo_Driver.cydsn\Dynamixel_Servo_Driver.cyprj
# Date: Sat, 09 May 2015 23:09:19 GMT
#set_units -time ns
create_clock -name {Clock_4(FFB)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {Clock_5(FFB)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/ff_div_9}]]
create_clock -name {UART_2_SCBCLK(FFB)} -period 1458.3333333333333 -waveform {0 729.166666666667} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {Clock_4} -source [get_pins {ClockBlock/hfclk}] -edges {1 25 49} [list]
create_generated_clock -name {Clock_5} -source [get_pins {ClockBlock/hfclk}] -edges {1 25 49} [list]
create_generated_clock -name {UART_2_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 35 71} [list]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 53 105} -nominal_period 2166.6666666666665 [list [get_pins {ClockBlock/udb_div_0}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]


# Component constraints for C:\Users\Samuel\Documents\GitHub\Arm\Dynamixel_Servo_Driver\Dynamixel_Servo_Driver.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Samuel\Documents\GitHub\Arm\Dynamixel_Servo_Driver\Dynamixel_Servo_Driver.cydsn\Dynamixel_Servo_Driver.cyprj
# Date: Sat, 09 May 2015 23:09:13 GMT
